2022_Summer/examples/curved_cube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0. 0. 0.)
    (1. 0. 0.)
    (1. 1. 0.)
    (0. 1. 0.)
    (0. 0. 1.)
    (1. 0. 1.)
    (1. 1. 1.)
    (0. 1. 1.)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (20 20 20) 
  simpleGrading 
  (
      1.0
      (
          (0.5 0.5 10)
          (0.5 0.5 0.1)
      )
      (
          (0.5 0.5 10)
          (0.5 0.5 0.1)
      )
  )
);

edges
(
 arc 0 1 (0.5 0.1 0.0)
 arc 4 5 (0.5 0.1 1.0) 
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 5 1)
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
