2022_Summer/examples/curved_cube/system/decomposeParDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  plus                                  | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains     4;

method             scotch;

simpleCoeffs 
{ 
    n             (2 1 1); 
    delta         0.001; 
} 

distributed         false;

roots();

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
